### Using pandas pyhton library

In [30]:
import numpy as np
import pandas as pd

In [44]:
revenue = pd.Series([5555,7000,1980])
revenue

0    5555
1    7000
2    1980
dtype: int64

In [45]:
pd.Series([5555,7000,1980])

0    5555
1    7000
2    1980
dtype: int64

In [46]:
revenue.index

RangeIndex(start=0, stop=3, step=1)

In [47]:
list(range(5,0,-1))

[5, 4, 3, 2, 1]

In [48]:
pd.Series([2,7,5],index=['val1','val2','val3'])

val1    2
val2    7
val3    5
dtype: int64

In [73]:
city_revenue = pd.Series([1000,2000,3000],index=['jakarta','bandung','depok'])
city_revenue

jakarta    1000
bandung    2000
depok      3000
dtype: int64

In [74]:
city_employee = pd.Series({'jakarta':545,'depok':334})
city_employee

jakarta    545
depok      334
dtype: int64

In [75]:
city_employee.keys()

Index(['jakarta', 'depok'], dtype='object')

In [76]:
# pengecekan key didalam suatu series
'menado' in city_employee

False

In [77]:
5 in city_employee.values

False

In [78]:
city_employee2 = city_employee.copy()
city_employee2.append(pd.Series({'menado':3}))

C:\Users\Farhan Zahirsyah\AppData\Local\Temp\ipykernel_20212\492974396.py:2: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  city_employee2.append(pd.Series({'menado':3}))

jakarta    545
depok      334
menado       3
dtype: int64

In [79]:
pd.DataFrame({'kolom1':[2,3,4,6],'kolom2':['a','s','d','f']})

   kolom1 kolom2
0       2      a
1       3      s
2       4      d
3       6      f

In [80]:
city_data = pd.DataFrame({
    'revenue' : city_revenue,
    'employee_count' : city_employee
})
city_data

         revenue  employee_count
bandung     2000             NaN
depok       3000           334.0
jakarta     1000           545.0

In [81]:
city_data.values

array([[2000.,   nan],
       [3000.,  334.],
       [1000.,  545.]])

In [82]:
city_data.axes

[Index(['bandung', 'depok', 'jakarta'], dtype='object'),
 Index(['revenue', 'employee_count'], dtype='object')]

In [83]:
city_data.axes[0]

Index(['bandung', 'depok', 'jakarta'], dtype='object')

In [84]:
city_data.axes[1]

Index(['revenue', 'employee_count'], dtype='object')

In [85]:
city_data

         revenue  employee_count
bandung     2000             NaN
depok       3000           334.0
jakarta     1000           545.0

In [90]:
1000 in city_data['revenue']

False

## Mengakses Elemen

In [91]:
city_revenue

jakarta    1000
bandung    2000
depok      3000
dtype: int64

In [92]:
city_revenue['jakarta']

1000

In [93]:
city_revenue[1]

2000

In [94]:
city_revenue[-1]

3000

In [95]:
city_revenue['bandung':]

bandung    2000
depok      3000
dtype: int64

In [96]:
colors = pd.Series(
    ["red", "purple", "blue", "green", "yellow"],
    index=[1, 2, 3, 5, 8]
)

In [97]:
colors

1       red
2    purple
3      blue
5     green
8    yellow
dtype: object

In [103]:
colors.iloc[3]

'green'

In [104]:
colors.loc[3]

'blue'

In [107]:
colors.loc[1:5]

1       red
2    purple
3      blue
5     green
dtype: object

## Pandas Loc dan Iloc

In [108]:
city_data.loc['jakarta']

revenue           1000.0
employee_count     545.0
Name: jakarta, dtype: float64

In [109]:
city_data

         revenue  employee_count
bandung     2000             NaN
depok       3000           334.0
jakarta     1000           545.0

In [113]:
city_data.loc['bandung':'depok','revenue']

bandung    2000
depok      3000
Name: revenue, dtype: int64

In [118]:
city_data.loc[['depok','jakarta'],:]

         revenue  employee_count
depok       3000           334.0
jakarta     1000           545.0

In [119]:
city_revenue.sum()

6000

In [120]:
city_revenue.mean()

2000.0

## Combining Multiple Dataset

- .Concat = menggabungkan secara vertikal atau horizontal
- .Merge

In [121]:
further_city_data = pd.DataFrame(
    {"revenue": [7000, 3400], "employee_count": [2, 2]},
    index=["New York", "Barcelona"]
)

In [127]:
all_city_data = pd.concat([city_data, further_city_data], sort=True)
all_city_data

           employee_count  revenue
bandung               NaN     2000
depok               334.0     3000
jakarta             545.0     1000
New York              2.0     7000
Barcelona             2.0     3400

In [131]:
city_countries = pd.DataFrame({
    "country": ["Holland", "Japan", "Holland", "Canada", "Spain"],
    "capital": [1, 1, 0, 0, 0]},
    index=["jakarta", "bandung", "depok", "Toronto", "Barcelona"]
)
city_countries

           country  capital
jakarta    Holland        1
bandung      Japan        1
depok      Holland        0
Toronto     Canada        0
Barcelona    Spain        0

In [135]:
cities = pd.concat([all_city_data,city_countries],axis=1,join='inner')
cities

           revenue  employee_count  revenue  employee_count  country  capital
bandung     2000.0             NaN      NaN             NaN    Japan        1
depok       3000.0           334.0      NaN             NaN  Holland        0
jakarta     1000.0           545.0      NaN             NaN  Holland        1
Barcelona      NaN             NaN   3400.0             2.0    Spain        0

In [137]:
cities = pd.concat([all_city_data,city_countries],axis=1,join='outer')
cities

           revenue  employee_count  revenue  employee_count  country  capital
bandung     2000.0             NaN      NaN             NaN    Japan      1.0
depok       3000.0           334.0      NaN             NaN  Holland      0.0
jakarta     1000.0           545.0      NaN             NaN  Holland      1.0
New York       NaN             NaN   7000.0             2.0      NaN      NaN
Barcelona      NaN             NaN   3400.0             2.0    Spain      0.0
Toronto        NaN             NaN      NaN             NaN   Canada      0.0

In [138]:
cities = pd.concat([all_city_data,city_countries],axis=1)
cities

           revenue  employee_count  revenue  employee_count  country  capital
bandung     2000.0             NaN      NaN             NaN    Japan      1.0
depok       3000.0           334.0      NaN             NaN  Holland      0.0
jakarta     1000.0           545.0      NaN             NaN  Holland      1.0
New York       NaN             NaN   7000.0             2.0      NaN      NaN
Barcelona      NaN             NaN   3400.0             2.0    Spain      0.0
Toronto        NaN             NaN      NaN             NaN   Canada      0.0

## Merge

In [140]:
countries = pd.DataFrame({
    "population_millions": [17, 127, 37],
    "continent": ["Europe", "Asia", "North America"]
}, index=["Holland", "Japan", "Canada"])
countries

         population_millions      continent
Holland                   17         Europe
Japan                    127           Asia
Canada                    37  North America

In [141]:
cities

           revenue  employee_count  revenue  employee_count  country  capital
bandung     2000.0             NaN      NaN             NaN    Japan      1.0
depok       3000.0           334.0      NaN             NaN  Holland      0.0
jakarta     1000.0           545.0      NaN             NaN  Holland      1.0
New York       NaN             NaN   7000.0             2.0      NaN      NaN
Barcelona      NaN             NaN   3400.0             2.0    Spain      0.0
Toronto        NaN             NaN      NaN             NaN   Canada      0.0

In [144]:
pd.merge(cities, 
        countries,
        left_on="country",
        right_index=True
        )

,revenue,employee_count,revenue,employee_count,country,capital,population_millions,continent
bandung,2000.0,NaN,NaN,NaN,Japan,1.0,127,Asia
depok,3000.0,334.0,NaN,NaN,Holland,0.0,17,Europe
jakarta,1000.0,545.0,NaN,NaN,Holland,1.0,17,Europe
Toronto,NaN,NaN,NaN,NaN,Canada,0.0,37,North America

In [147]:
pd.merge(
    cities,
    countries,
    left_on="country",
    right_index=True,
    how="left"
)

,revenue,employee_count,revenue,employee_count,country,capital,population_millions,continent
bandung,2000.0,NaN,NaN,NaN,Japan,1.0,127.0,Asia
depok,3000.0,334.0,NaN,NaN,Holland,0.0,17.0,Europe
jakarta,1000.0,545.0,NaN,NaN,Holland,1.0,17.0,Europe
New York,NaN,NaN,7000.0,2.0,NaN,NaN,NaN,NaN
Barcelona,NaN,NaN,3400.0,2.0,Spain,0.0,NaN,NaN
Toronto,NaN,NaN,NaN,NaN,Canada,0.0,37.0,North America

In [148]:
pd.merge(
    cities,
    countries,
    left_on="country",
    right_index=True,
    how="right"
)

,revenue,employee_count,revenue,employee_count,country,capital,population_millions,continent
depok,3000.0,334.0,NaN,NaN,Holland,0.0,17,Europe
jakarta,1000.0,545.0,NaN,NaN,Holland,1.0,17,Europe
bandung,2000.0,NaN,NaN,NaN,Japan,1.0,127,Asia
Toronto,NaN,NaN,NaN,NaN,Canada,0.0,37,North America